{
  "External Communication Management": {
    "description": "The methods and means of which a team communicate with all external parties involved in the development of the project, such as the primary stakeholders and vendor representatives. This can include how well external stakeholders are interacted with, how their needs are handled, if they are ready and trained to handle the deployment of the project. ",
    "terms": [{
        "name": "Ineffective External Interaction",
        "description": "When communication between parties outside of the development of the project who are indirectly involved is poor",
        "weighting": 0.04
      },
      {
        "name": "Poor stakeholder management/Stakeholder Engagement",
        "description": "When communication and organisation of stakeholders and their responsibilities is inadequate",
        "weighting": 0.30
      },
      {
        "name": "Poor Vendor Management",
        "description": "Poorly and ineffectively controlling and overseeing of the necessary external vendors required to help the project succeed",
        "weighting": 0.13
      },
      {
        "name": "Poor Contract Management",
        "description": "When necessary contracts that have been created for the purpose of the project have been poorly communicated or breached",
        "weighting": 0.12
      },
      {
        "name": "Inadequate Customer Support and Training",
        "description": "When there is readily available support for end users of the final product. When deployed successfully, it can help a recently completed project stay afloat. This also includes if stakeholder/users have been trained to use the system correctly when it is live",
        "weighting": 0.12
      }
    ]
  },
  "Budget management": {
    "description": "Represents the level of control a team has over their financial resources. There are a variety of different factors which impact and influence budget management differently but are all significant. Important factors to consider are budget overruns/mismanagement and how well resources are dispersed across the production timeline.",
    "terms": [{
      "name": "Poor Budget Management",
      "description": "When the financial resources of the project are poorly allocated and mis-used, therefore leaving project development with less resources than originally planned. This also includes unplanned expenditures",
      "weighting": 0.16
    }]
  },
  "Leadership and Team (Internal) Management": {
    "description": "Best represents the composition of a team and how it is controlled, dictated, and lead, such as the strength and confidence of whomever oversees the project, and the overall composition and culture of the team members. This also includes staff morale, managing and removing roadblocks. This also includes risk management and how leadership and members of the team minimize or remove risks in the project.",
    "terms": [{
        "name": "Untrained staff/Resources",
        "description": "When the staff on the project are not properly equipped or experienced to develop the project. This has significant impact on development",
        "weighting": 0.09
      },
      {
        "name": "Inexperienced Leadership",
        "description": "When the leader(s) of the project do not have enough experience in that particular field, or in leading a team, it can slow project development to a crawl, or complete stop altogether",
        "weighting": 0.25
      },
      {
        "name": "Poor Project Management and Governance",
        "description": "When overall project development and team designation is badly handled and poorly executed. For example, assigning team members to incorrect role, or mismanaging the planning and execution of the project. This can also include managements inability to admin defeat when a project has failed, or is about to fail",
        "weighting": 0.37
      },
      {
        "name": "Poor Culture and staff morale",
        "description": "When the mentality and ethic of a development team is not taken seriously. Team members require a positive work environment to thrive and without it, development could cease altogether",
        "weighting": 0.18
      },
      {
        "name": "Poor Risk Management",
        "description": "When potential risks to the project’s development or launch are not foreseen/handled well enough, it can greatly impact success chance",
        "weighting": 0.22
      },
      {
        "name": "Inadequate resource allocation",
        "description": "When the resources needed for the project to succeed are appropriately used and allocated. This includes how staff are allocated to different aspects of the project",
        "weighting": 0.02
      }
    ]
  },
  "Change and Scope Management": {
    "description": "Describes the level of control and understanding the team has of the requirements set before them. Managing change is important to prepare for expected and unexpected modifications. Managing scope is the understand what is required for the project to succeed and ensuring scope-creep (uncontrolled growth of project requirements) is managed and expectations are contained.",
    "terms": [{
        "name": "Scope Creep",
        "description": "The addition of extra requirements beyond the initial scope of the project",
        "weighting": 0.27
      },
      {
        "name": "Lack of adherence to correct change management strategies ",
        "description": "The strategies in place to manage resources that ensure a correct business outcome and allow for the correct introduction of change into a project. Change is anything that can impact the project",
        "weighting": 0.13
      }
    ]
  },
  "Time Management": {
    "description": "Time Management is the method for controlling and directing the tasks needed for the project to be completed within a given time frame and reaching pre-determined milestones. Missed milestones and inadequate scheduling of the project timeline are key risk factors that could issues in our groupings, such as increased risk and increased spending. Lack of Time Management can also decrease Quality Assurance as the timeline is changed to ensure the project is delivered on time.",
    "terms": [{
        "name": "Missed Milestones",
        "description": "When tasks are not completed by a specified time or date, a backlog can occur which can slow development",
        "weighting": 0.15
      },
      {
        "name": "Poor Schedule Management",
        "description": "When tasks are not given an end date, or go overtime, a backlog can occur. As well as, the inability to modify the timeline when new requirements were added",
        "weighting": 0.07
      }
    ]
  },
  "Quality Assurance": {
    "description": "The technique involving constant and efficient checking on all aspects quality of the product being produced. Aspects such as testing, various system integrations and customer support all fall under this category. If testing requirements decrease or are not performed, this is a good indicator that the delivered product could contain defects. Lack of following industry best practices (ITIL, etc) could cause the project to fail.",
    "terms": [{
        "name": "Lack of Testing",
        "description": "When testing is not carried out throughout the development of the project, it can mean that bugs are present and will be undetectable in later stages of the development. It can also mean features may have unintended side effects, or not function as required, which can be a failure in the eyes of the end-users",
        "weighting": 0.17
      },
      {
        "name": "Lack of adherence to Industry Best Practices",
        "description": "If industry best practices are not followed (Such as ITIL), it can lead to following poor or incorrect processes that increase the probability of project success. These processes exist to ensure business and customer values are aligned.",
        "weighting": 0.10
      },
      {
        "name": "Project Defects",
        "description": "- Project defects are identified components of the project that faulty or deficient in some way. These defects are usually repairable but can take an undetermined time. Defects are usually discovered during extensive testing. Leaving defects in can lead to unwanted experiences for the user, system crashes and instability, and increase technical debt",
        "weighting": 0.03
      }
    ]
  },
  "Planning/Requirements Gathering": {
    "description": "This category is the acquiring and managing of necessary resources and applicable systems for the project to come fully into complete, functional fruition.",
    "terms": [{
        "name": "Poor Service Requirement and Lack of Requirement Analysis",
        "description": "If the requirements of the project are not fully realised then at some point in the project you risk coming to a standstill as further requirements are needed and no longer available.",
        "weighting": 0.05
      },
      {
        "name": "Poor Service Design",
        "description": "When the services have been selected, but poorly allocated, it could potentially lead to hindering the development of the project as components that should be working side by side are either unavailable at necessary times or not configured correctly",
        "weighting": 0.03
      }
    ]
  }
}